snegovick/zephyr_modules_apm32/include/zephyr/dt-bindings/clock/apm32_clock_f1.h
/*
 * Copyright (c) 2023, Quincy.W <wangqyfm@foxmail.com>
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_APM32_CLOCK_F1_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_APM32_CLOCK_F1_H_

#include "apm32_clock.h"

#define APM32_AHBPCLKEN_OFFSET 0x14
#define APM32_APB2PCLKEN_OFFSET 0x18
#define APM32_APB1PCLKEN_OFFSET 0x1C
#define APM32_BDCTRL_OFFSET 0x1C

#define APM32_CLOCK_RTC ((APM32_BDCTRL_OFFSET << APM32_CLOCK_REG_OFFSET) | 15) // RCM_BDCTRL.15 

#define APM32_CLOCK_DMA1 ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 0)	// RCM_AHBPCLKEN.0
#define APM32_CLOCK_DMA2 ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 1)	// RCM_AHBPCLKEN.1
#define APM32_CLOCK_SRAM ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 2)	// RCM_AHBPCLKEN.2
#define APM32_CLOCK_FPU ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 3)	// RCM_AHBPCLKEN.3
#define APM32_CLOCK_FMC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 4)	// RCM_AHBPCLKEN.4
#define APM32_CLOCK_QSPI ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 5)	// RCM_AHBPCLKEN.5
#define APM32_CLOCK_CRC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 6)	// RCM_AHBPCLKEN.6
#define APM32_CLOCK_EMMC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 8)	// RCM_AHBPCLKEN.8
#define APM32_CLOCK_RNG ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 9)	// RCM_AHBPCLKEN.9
#define APM32_CLOCK_SDIO ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 10) // RCM_AHBPCLKEN.10
#define APM32_CLOCK_OTGFS ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 12) // RCM_AHBPCLKEN.12
#define APM32_CLOCK_MAC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 14) // RCM_AHBPCLKEN.14
#define APM32_CLOCK_MACTX ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 15) // RCM_AHBPCLKEN.15
#define APM32_CLOCK_MACRX ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 16) // RCM_AHBPCLKEN.16

#define APM32_CLOCK_AFIO ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 0)	   // RCM_APB2PCLKEN.0
#define APM32_CLOCK_GPIOA ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 2)   // RCM_APB2PCLKEN.2
#define APM32_CLOCK_GPIOB ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 3)   // RCM_APB2PCLKEN.3
#define APM32_CLOCK_GPIOC ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 4)   // RCM_APB2PCLKEN.4
#define APM32_CLOCK_GPIOD ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 5)   // RCM_APB2PCLKEN.5
#define APM32_CLOCK_GPIOE ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 6)   // RCM_APB2PCLKEN.6
#define APM32_CLOCK_GPIOF ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 7)   // RCM_APB2PCLKEN.7
#define APM32_CLOCK_GPIOG ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 8)   // RCM_APB2PCLKEN.8
#define APM32_CLOCK_ADC1 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 9)   // RCM_APB2PCLKEN.9
#define APM32_CLOCK_ADC2 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 10)   // RCM_APB2PCLKEN.10
#define APM32_CLOCK_TIM1 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 11)   // RCM_APB2PCLKEN.11
#define APM32_CLOCK_SPI1 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 12)   // RCM_APB2PCLKEN.12
#define APM32_CLOCK_TIM8 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 13)   // RCM_APB2PCLKEN.13
#define APM32_CLOCK_USART1 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 14) // RCM_APB2PCLKEN.14

#define APM32_CLOCK_TIM2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 0)	   // RCM_APB1PCLKEN.0
#define APM32_CLOCK_TIM3 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 1)	   // RCM_APB1PCLKEN.1
#define APM32_CLOCK_TIM4 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 2)	   // RCM_APB1PCLKEN.2
#define APM32_CLOCK_TIM5 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 3)	   // RCM_APB1PCLKEN.3
#define APM32_CLOCK_TIM6 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 4)	   // RCM_APB1PCLKEN.4
#define APM32_CLOCK_TIM7 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 5)	   // RCM_APB1PCLKEN.5
#define APM32_CLOCK_WWDG ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 11)   // RCM_APB1PCLKEN.11
#define APM32_CLOCK_SPI2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 14)   // RCM_APB1PCLKEN.14
#define APM32_CLOCK_SPI3 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 15)   // RCM_APB1PCLKEN.15
#define APM32_CLOCK_USART2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 17) // RCM_APB1PCLKEN.17
#define APM32_CLOCK_USART3 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 18) // RCM_APB1PCLKEN.18
#define APM32_CLOCK_UART4 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 19)  // RCM_APB1PCLKEN.19
#define APM32_CLOCK_UART5 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 20)  // RCM_APB1PCLKEN.20
#define APM32_CLOCK_I2C1 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 21)   // RCM_APB1PCLKEN.21
#define APM32_CLOCK_I2C2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 22)   // RCM_APB1PCLKEN.22
#define APM32_CLOCK_USB ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 23)	   // RCM_APB1PCLKEN.23
#define APM32_CLOCK_CAN1 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 25)   // RCM_APB1PCLKEN.25
#define APM32_CLOCK_CAN2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 26)   // RCM_APB1PCLKEN.26
#define APM32_CLOCK_BKP ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 27)	   // RCM_APB1PCLKEN.27
#define APM32_CLOCK_PMU ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 28)	   // RCM_APB1PCLKEN.28
#define APM32_CLOCK_DAC ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 29)	   // RCM_APB1PCLKEN.29

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_APM32_CLOCK_F1_H_ */
